In [1]:
use books_store_db

# Selecting data from many tables - exercises

## Demo Database : books_store_db

### Entity-Realacionshihp (ER) Diagram:

<img src="../images/books_store_db.png" alt="books_store_db.png">

### DB Dump:

You can load the scema and data from next dump file: <a href="../db_dumps/books_store_db_dump.sql" download>books_store_db_dump.sql</a>

## Tasks

### Task 1 

Select (fname, lname,book_name) for all books published by all authors

### Task 2

Select (book_name, pub_year) of the books written by Douglas Adams, sorted by book_name

### Task 3

Select (fname, lname, book_name, pub_year) for the author who has published the earliest book.

**Tip**: use `SELECT MIN(pub_year) FROM books` to select earliest pub_year

### Task 4

Select (fname, laname, books_count) for authors and the books count each have published, sorted descending by books_count

### Task 5

Select authors.lname for authors who have published books after 1950

### Task 6

Select book_name, authors.lname for books published after 1970

,book_name,lname
0,Breakfast of Champions,Vonnegut
1,The Hitchhiker's Guide to the Galaxy,Adams
2,The Restaurant at the End of the Universe,Adams
3,Life,Adams
4,So Long,Adams
5,Young Zaphod Plays It Safe,Adams
6,Dirk Gently's Holistic Detective Agency,Adams
7,Last Chance to See,Adams
8,Mostly Harmless,Adams
9,Natural Novel,Gospodinov
10,And Other Stories,Gospodinov
11,The Physics of Sorrow,Gospodinov
12,Time Shelter,Gospodinov

### Task 7

Select fname,lname for the author who had sell most books

,fname,lname
0,Georgi,Gospodinov

### Task 8

Select (book_name, pub_year) of the first and last book published by Douglas Adams

,book_name,pub_year
0,The Hitchhiker's Guide to the Galaxy,1979
1,Mostly Harmless,1992

### Task 9

Select (name,city) for all clients who have associated city

,name,city
0,Ivan,Sofia
1,Ivan,New York
2,Lily,Sofia
3,Merry,Paris
4,Peter,Lodon

### Task 10

Select (name,city) for all clients, no matter if there is a recorded city, sorted by name

,name,city
0,Ivan,Sofia
1,Ivan,New York
2,John,None
3,Lily,Sofia
4,Merry,Paris
5,Peter,Lodon

### Task 11

Select name, book_name for all clients and all books they have ordered

,name,book_name
0,Ivan,The Sirens of Titan
1,Ivan,God Bless You
2,Ivan,Slaughterhouse
3,Ivan,The Hitchhiker's Guide to the Galaxy
4,Ivan,Natural Novel
5,Ivan,The Physics of Sorrow
6,John,The Hitchhiker's Guide to the Galaxy
7,John,So Long
8,John,Alice's Adventures in Wonderland
9,Merry,Dirk Gently's Holistic Detective Agency
10,Merry,The Physics of Sorrow
11,Lily,Natural Novel
12,Lily,The Physics of Sorrow

### Task 12

Select clients.name, book_name, authors.lname for all clients and all books each client had ordered

,name,book_name,lname
0,Ivan,The Hitchhiker's Guide to the Galaxy,Adams
1,John,The Hitchhiker's Guide to the Galaxy,Adams
2,John,So Long,Adams
3,Merry,Dirk Gently's Holistic Detective Agency,Adams
4,John,Alice's Adventures in Wonderland,Carroll
5,Ivan,Natural Novel,Gospodinov
6,Lily,Natural Novel,Gospodinov
7,Ivan,The Physics of Sorrow,Gospodinov
8,Merry,The Physics of Sorrow,Gospodinov
9,Lily,The Physics of Sorrow,Gospodinov
10,Ivan,The Sirens of Titan,Vonnegut
11,Ivan,God Bless You,Vonnegut
12,Ivan,Slaughterhouse,Vonnegut

### Task 13

Select book_name for all books ordered by 'Ivan'

,book_name,name
0,The Sirens of Titan,Ivan
1,God Bless You,Ivan
2,Slaughterhouse,Ivan
3,The Hitchhiker's Guide to the Galaxy,Ivan
4,Natural Novel,Ivan
5,The Physics of Sorrow,Ivan

### Task 14

Select * for all clients who have not order any book

,id,name,age
0,4,Peter,35

### Task 15

Select how many books each client have ordered

,name,book_count
0,Ivan,6
1,John,3
2,Merry,2
3,Lily,2

### Task 16

Select book_name, name, age for books ordered by clients aged > 30 years

,book_name,name,age
0,The Hitchhiker's Guide to the Galaxy,John,34
1,So Long,John,34
2,Alice's Adventures in Wonderland,John,34

### Task 17

Select clients.name, books.book_name, authors.lname for books ordered by clients aged > 20 years

,name,book_name,lname
0,Ivan,The Sirens of Titan,Vonnegut
1,Ivan,God Bless You,Vonnegut
2,Ivan,Slaughterhouse,Vonnegut
3,Ivan,The Hitchhiker's Guide to the Galaxy,Adams
4,Ivan,Natural Novel,Gospodinov
5,Ivan,The Physics of Sorrow,Gospodinov
6,John,The Hitchhiker's Guide to the Galaxy,Adams
7,John,So Long,Adams
8,John,Alice's Adventures in Wonderland,Carroll
9,Lily,Natural Novel,Gospodinov
10,Lily,The Physics of Sorrow,Gospodinov

### Task 18

Select city, clients.name for the client who have ordered most books

,city,name
0,Sofia,Ivan
1,New York,Ivan